{
    "kind": "Scheduled",
    "properties": {
        "description": "Identifies a match in AzureActivity table from any Email IOC from TI",
        "displayName": "TI map Email entity to AzureActivity",
        "enabled": true,
        "query": "let dt_lookBack = 1h;\nlet ioc_lookBack = 14d;\nlet emailregex = @'^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\\.[a-zA-Z0-9-.]+$';\nThreatIntelligenceIndicator\n//Filtering the table for Email related IOCs\n| where isnotempty(EmailSenderAddress)\n| where TimeGenerated >= ago(ioc_lookBack)\n| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId\n| where Active == true and ExpirationDateTime > now()\n// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated\n| join kind=innerunique (\n    AzureActivity | where TimeGenerated >= ago(dt_lookBack) and isnotempty(Caller)\n    | extend Caller = tolower(Caller)\n    | where Caller matches regex emailregex\n    | extend AzureActivity_TimeGenerated = TimeGenerated\n)\non $left.EmailSenderAddress == $right.Caller\n| where AzureActivity_TimeGenerated < ExpirationDateTime\n| summarize AzureActivity_TimeGenerated = arg_max(AzureActivity_TimeGenerated, *) by IndicatorId, Caller\n| project AzureActivity_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, Url, EmailSenderName, EmailRecipient,\nEmailSourceDomain, EmailSourceIpAddress, EmailSubject, FileHashValue, FileHashType, Caller, Level, CallerIpAddress, CategoryValue, OperationNameValue, ActivityStatusValue,\nResourceGroup, SubscriptionId\n| extend Name = tostring(split(Caller, '@', 0)[0]), UPNSuffix = tostring(split(Caller, '@', 1)[0])\n| extend timestamp = AzureActivity_TimeGenerated\n",
        "queryFrequency": "PT1H",
        "queryPeriod": "P14D",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "InitialAccess"
        ],
        "techniques": [
            "T1566"
        ],
        "entityMappings": [
            {
                "entityType": "Account",
                "fieldMappings": [
                    {
                        "identifier": "FullName",
                        "columnName": "Caller"
                    },
                    {
                        "identifier": "Name",
                        "columnName": "Name"
                    },
                    {
                        "identifier": "UPNSuffix",
                        "columnName": "UPNSuffix"
                    }
                ]
            },
            {
                "entityType": "IP",
                "fieldMappings": [
                    {
                        "identifier": "Address",
                        "columnName": "CallerIpAddress"
                    }
                ]
            },
            {
                "entityType": "URL",
                "fieldMappings": [
                    {
                        "identifier": "Url",
                        "columnName": "Url"
                    }
                ]
            }
        ],
        "alertRuleTemplateName": "cca3b4d9-ac39-4109-8b93-65bb284003e6",
        "templateVersion": "1.2.7"
    }
}
