{
    "kind": "Scheduled",
    "properties": {
        "description": "LaZagne is a popular open-source tool used to recover passwords stored on a local computer. It has been used in ransomware attacks to steal credentials and escalate privileges. This query looks for the execution of LaZagne.",
        "displayName": "LaZagne Credential Theft",
        "enabled": true,
        "query": "DeviceProcessEvents \n| where FileName =~ 'reg.exe'\n| where ProcessCommandLine has_all('save','hklm','sam')\n| project DeviceId, DeviceName, TimeGenerated, InitiatingProcessId, InitiatingProcessFileName, ProcessId, FileName, ProcessCommandLine\n| extend HostName = iff(DeviceName has '.', substring(DeviceName, 0, indexof(DeviceName, '.')), DeviceName)\n| extend DnsDomain = iff(DeviceName has '.', substring(DeviceName, indexof(DeviceName, '.') + 1), \"\")\n",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "CredentialAccess"
        ],
        "techniques": [
            "T1003"
        ],
        "entityMappings": [
            {
                "entityType": "Host",
                "fieldMappings": [
                    {
                        "columnName": "DeviceName",
                        "identifier": "FullName"
                    },
                    {
                        "columnName": "HostName",
                        "identifier": "HostName"
                    },
                    {
                        "columnName": "DnsDomain",
                        "identifier": "DnsDomain"
                    }
                ]
            },
            {
                "entityType": "Process",
                "fieldMappings": [
                    {
                        "columnName": "ProcessId",
                        "identifier": "ProcessId"
                    },
                    {
                        "columnName": "ProcessCommandLine",
                        "identifier": "CommandLine"
                    }
                ]
            }
        ],
        "alertRuleTemplateName": "7d0d3050-8dac-4b83-bfae-902f7dc0c21c",
        "templateVersion": "1.0.0"
    }
}
