{
    "kind": "Scheduled",
    "properties": {
        "description": "Image Scanning for ECR was disabled, which could lead to missing vulnerable container images in your environment. Attackers could disable the Image Scanning for defense evasion purposes.",
        "displayName": "Automatic image scanning disabled for ECR",
        "enabled": true,
        "query": "AWSCloudTrail\n| where EventName == \"PutImageScanningConfiguration\" and isempty(ErrorCode) and isempty(ErrorMessage)\n| extend scanOnPush = parse_json(tostring((parse_json(RequestParameters).imageScanningConfiguration))).scanOnPush\n| where scanOnPush == false\n| extend UserIdentityArn = iif(isempty(UserIdentityArn), tostring(parse_json(Resources)[0].ARN), UserIdentityArn)\n| extend UserName = tostring(split(UserIdentityArn, '/')[-1])\n| extend AccountName = case( UserIdentityPrincipalid == \"Anonymous\", \"Anonymous\", isempty(UserIdentityUserName), UserName, UserIdentityUserName)\n| extend AccountName = iif(AccountName contains \"@\", tostring(split(AccountName, '@', 0)[0]), AccountName),\n  AccountUPNSuffix = iif(AccountName contains \"@\", tostring(split(AccountName, '@', 1)[0]), \"\")\n| distinct TimeGenerated, EventName, SourceIpAddress, UserIdentityArn, UserIdentityUserName, RecipientAccountId, AccountName, AccountUPNSuffix\n| extend timestamp = TimeGenerated\n",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "DefenseEvasion"
        ],
        "techniques": [
            "T1562"
        ],
        "entityMappings": [
            {
                "entityType": "Account",
                "fieldMappings": [
                    {
                        "columnName": "AccountName",
                        "identifier": "Name"
                    },
                    {
                        "columnName": "AccountUPNSuffix",
                        "identifier": "UPNSuffix"
                    },
                    {
                        "columnName": "RecipientAccountId",
                        "identifier": "CloudAppAccountId"
                    }
                ]
            },
            {
                "entityType": "IP",
                "fieldMappings": [
                    {
                        "columnName": "SourceIpAddress",
                        "identifier": "Address"
                    }
                ]
            }
        ],
        "alertRuleTemplateName": "19602494-94af-43c8-90ba-eb0e14999612",
        "templateVersion": "1.0.1"
    }
}
