{
    "kind": "Scheduled",
    "properties": {
        "description": "This detection flags the occurrences of deleting multiple teams within an hour.\nThis data is a part of Office 365 Connector in Microsoft Sentinel.",
        "displayName": "Multiple Teams deleted by a single user",
        "enabled": true,
        "query": "// Adjust this value to change how many Teams should be deleted before including\nlet max_delete_count = 3;\n// Adjust this value to change the timewindow the query runs over\n  OfficeActivity\n| where OfficeWorkload =~ \"MicrosoftTeams\"\n| where Operation =~ \"TeamDeleted\"\n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), DeletedTeams = make_set(TeamName, 1000) by UserId\n| where array_length(DeletedTeams) > max_delete_count\n| extend AccountName = tostring(split(UserId, \"@\")[0]), AccountUPNSuffix = tostring(split(UserId, \"@\")[1])\n",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "severity": "Low",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "Impact"
        ],
        "techniques": [
            "T1485",
            "T1489"
        ],
        "entityMappings": [
            {
                "entityType": "Account",
                "fieldMappings": [
                    {
                        "identifier": "FullName",
                        "columnName": "UserId"
                    },
                    {
                        "identifier": "Name",
                        "columnName": "AccountName"
                    },
                    {
                        "identifier": "UPNSuffix",
                        "columnName": "AccountUPNSuffix"
                    }
                ]
            }
        ],
        "alertRuleTemplateName": "173f8699-6af5-484a-8b06-8c47ba89b380",
        "templateVersion": "2.0.4"
    }
}
